
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастроитьВидимость(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура БессрочныйПриИзменении(Элемент)
	НастроитьВидимостьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	ОбновитьНаименованиеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ОбновитьНаименованиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьНаСервере()
	НастроитьВидимость(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимость(Форма)
	Форма.Элементы.ДатаОкончания.Видимость = НЕ Форма.Объект.Бессрочный;
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаименованиеНаСервере()
	Номер     = СокрЛП(Объект.Номер);
	ДатаНач   = Объект.ДатаНачала;
	Если ЗначениеЗаполнено(Номер) И ЗначениеЗаполнено(ДатаНач) Тогда
		Объект.Description = "№" + Номер + " от " + Формат(ДатаНач, "ДЛФ=D") + " г";
	ИначеЕсли ЗначениеЗаполнено(Номер) Тогда
		Объект.Description = "№" + Номер;
	КонецЕсли;
КонецПроцедуры
