Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
        Ответственный = Пользователи.ТекущийПользователь();
    КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Реализация") Тогда
		ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ОплатаОтПокупателя;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
		ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ВозвратОтПоставщика;
	Иначе
		Возврат;
	КонецЕсли;

	Организация       = ДанныеЗаполнения.Организация;
	Плательщик        = ДанныеЗаполнения.Контрагент;
	Договор           = ДанныеЗаполнения.Договор;
	СуммаДокумента    = ДанныеЗаполнения.СуммаДокумента;
	ДокументОснование = ДанныеЗаполнения;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    Движения.ДенежныеСредства.Записывать = Истина;
    Движения.Хозрасчетный.Записывать     = Истина;

    Движение             = Движения.ДенежныеСредства.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    Движение.Период      = Дата;
    Движение.Организация = Организация;
    Движение.Касса       = Касса;
    Движение.Сумма       = СуммаДокумента;

    АналитикаПроводки = ПолучитьАналитикуПроводки();
    ДвижениеБух            = Движения.Хозрасчетный.Добавить();
    ДвижениеБух.Период     = Дата;
    ДвижениеБух.СчетДт     = АналитикаПроводки.СчетДебета;
    ДвижениеБух.СчетКт     = АналитикаПроводки.СчетКредита;
    ДвижениеБух.Сумма      = СуммаДокумента;
    ДвижениеБух.Содержание = АналитикаПроводки.СодержаниеОперации;
    БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(
        ДвижениеБух.СчетДт, ДвижениеБух.СубконтоДт, АналитикаПроводки.СубконтоДебет);
    БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(
        ДвижениеБух.СчетКт, ДвижениеБух.СубконтоКт, АналитикаПроводки.СубконтоКредит);

КонецПроцедуры

Функция ПолучитьАналитикуПроводки()
    АналитикаПроводки = Новый Структура;
    АналитикаПроводки.Вставить("СчетДебета",    ПланыСчетов.Хозрасчетный.Касса);
    АналитикаПроводки.Вставить("СубконтоДебет", Касса);
    Если ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ОплатаОтПокупателя Тогда
        АналитикаПроводки.Вставить("СчетКредита",        ПланыСчетов.Хозрасчетный.РасчетыСПокупателями);
        АналитикаПроводки.Вставить("СубконтоКредит",     Плательщик);
        АналитикаПроводки.Вставить("СодержаниеОперации", "Оплата от покупателя наличными в кассу");
    ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ВозвратОтПоставщика Тогда
        АналитикаПроводки.Вставить("СчетКредита",        ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками);
        АналитикаПроводки.Вставить("СубконтоКредит",     Плательщик);
        АналитикаПроводки.Вставить("СодержаниеОперации", "Возврат от поставщика наличными в кассу");
    ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника Тогда
        АналитикаПроводки.Вставить("СчетКредита",        ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами);
        АналитикаПроводки.Вставить("СубконтоКредит",     Плательщик);
        АналитикаПроводки.Вставить("СодержаниеОперации", "Возврат подотчётных средств наличными в кассу");
    КонецЕсли;
    Возврат АналитикаПроводки;
КонецФункции

