
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
        Попытка
            Ответственный = Пользователи.ТекущийПользователь();
        Исключение
        КонецПопытки;
    КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    Движения.ЗаказыКлиентов.Записывать = Истина;

    СуммаУслуг = Услуги.Итог("Сумма");

    Движение              = Движения.ЗаказыКлиентов.Добавить();
    Движение.ВидДвижения  = ВидДвиженияНакопления.Приход;
    Движение.Период       = Дата;
    Движение.Организация  = Организация;
    Движение.Клиент       = Клиент;
    Движение.ЗаказКлиента = Ссылка;
    Движение.Сумма        = СуммаУслуг;

КонецПроцедуры