Функция ВыполнитьАутентификацию(Логин) Экспорт
    Попытка
        Соединение = Новый HTTPСоединение("127.0.0.1",,"MobileClient","mobile123");
        Запрос = Новый HTTPЗапрос("/salon/hs/users/getUser?username=" + Логин);
        Ответ = Соединение.Получить(Запрос);
        Если Ответ.КодСостояния = 200 Тогда
            ЧтениеJSON = Новый ЧтениеJSON;
            ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
            Найден = ПрочитатьJSON(ЧтениеJSON);
            ЧтениеJSON.Закрыть();
            Если Найден = Истина Тогда
                Возврат Истина;
            Иначе
                Сообщить("Пользователь " + Логин + " не найден!");
            КонецЕсли;
        Иначе
            Сообщить("Ошибка аутентификации, код: " + Ответ.КодСостояния);
        КонецЕсли;
    Исключение
        Сообщить("Сетевая ошибка: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
    КонецПопытки;
    Возврат Ложь;
КонецФункции

Процедура АвторизоватьПользователя(Логин) Экспорт
    УстановитьПривилегированныйРежим(Истина);

    ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Логин);
    Если ПользовательИБ = Неопределено Тогда
        ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
        ПользовательИБ.Имя                   = Логин;
        ПользовательИБ.ПолноеИмя             = Логин;
        ПользовательИБ.АутентификацияСтандартная = Истина;
    КонецЕсли;
	ПользовательИБ.Роли.Очистить();
	ПользовательИБ.Роли.Добавить(Метаданные.Роли.АвторизованныйПользователь);
	ПользовательИБ.Записать();
	
	Если Справочники.Пользователи.НайтиПоНаименованию(Логин, Истина).Пустая() Тогда
		Пользователь = Справочники.Пользователи.СоздатьЭлемент();
		Пользователь.Наименование = Логин;
		Пользователь.Записать();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура РазавторизоватьПользователя() Экспорт
    УстановитьПривилегированныйРежим(Истина);

    ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
    Если ПользовательИБ <> Неопределено И НЕ ПользовательИБ.Роли.Содержит(Метаданные.Роли.ПолныеПрава) Тогда
        СсылкаПользователя = Справочники.Пользователи.НайтиПоНаименованию(ПользовательИБ.Имя, Истина);
        Если НЕ СсылкаПользователя.Пустая() Тогда
            СсылкаПользователя.ПолучитьОбъект().Удалить();
        КонецЕсли;
        ПользовательИБ.Удалить();
    КонецЕсли;

    УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Функция ЛогинТекущегоПользователя() Экспорт
    Выборка = Справочники.Пользователи.Выбрать();
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Наименование;
    КонецЕсли;
    Возврат ИмяПользователя();
КонецФункции