
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастроитьВидимость(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТипОрганизацииПриИзменении(Элемент)
	НастроитьВидимостьНаСервере();
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьНаСервере()
	НастроитьВидимость(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимость(Форма)
	ЭтоЮрЛицо = Форма.Объект.ТипОрганизации = Перечисления.ТипыОрганизаций.ЮридическоеЛицо;
	Форма.Элементы.ГлавныйБухгалтер.Видимость = ЭтоЮрЛицо;
КонецПроцедуры
