
Функция getUserGET(Запрос)
    Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username"));
    ЗапросКонтрагенты = Новый Запрос;
    ЗапросКонтрагенты.УстановитьПараметр("Логин", Логин);
    ЗапросКонтрагенты.Текст =
        "ВЫБРАТЬ ПЕРВЫЕ 1 Контрагенты.Ссылка
        |ИЗ Справочник.Контрагенты КАК Контрагенты
        |ГДЕ Контрагенты.ПользовательМП = &Логин
        |    И НЕ Контрагенты.ПометкаУдаления";
    Найден = НЕ ЗапросКонтрагенты.Выполнить().Пустой();

    Ответ = Новый HTTPСервисОтвет(200);
    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку();
    ЗаписатьJSON(ЗаписьJSON, Найден);
    Ответ.УстановитьТелоИзСтроки(ЗаписьJSON.Закрыть());
    Возврат Ответ;
КонецФункции

