
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    МассивПараметров = Новый Массив;
    МассивПараметров.Добавить(Новый ПараметрВыбора("Владелец", Объект.Ссылка));
    Элементы.Договор.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);	НастроитьВидимость(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
	НастроитьВидимостьНаСервере();
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьНаСервере()
	НастроитьВидимость(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимость(Форма)
	ТипКонтрагента = Форма.Объект.ТипКонтрагента;
	ЭтоКлиент          = ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиент;
	ЭтоПоставщикПокупатель = ТипКонтрагента = Перечисления.ТипыКонтрагентов.Поставщик
		ИЛИ ТипКонтрагента = Перечисления.ТипыКонтрагентов.Покупатель;

	Форма.Элементы.ДатаРожденияКлиента.Видимость = ЭтоКлиент;
	Форма.Элементы.ПолКлиента.Видимость          = ЭтоКлиент;
	Форма.Элементы.Договор.Видимость             = ЭтоПоставщикПокупатель;

	Если ЭтоКлиент Тогда
		Форма.Элементы.Наименование.Заголовок = "ФИО";
	Иначе
		Форма.Элементы.Наименование.Заголовок = "Наименование";
	КонецЕсли;
КонецПроцедуры

