Функция ОтправитьЗаписьВЦентральнуюБазу(СтрокаJSON) Экспорт
    Попытка
        Соединение = Новый HTTPСоединение("127.0.0.1",,"MobileClient","mobile123");
        HTTPЗапросОтправить = Новый HTTPЗапрос("/salon/hs/customerOrders/createOrder");
        HTTPЗапросОтправить.УстановитьТелоИзСтроки(СтрокаJSON);
        Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапросОтправить);
        Возврат Ответ.КодСостояния = 200;
    Исключение
        Сообщить("Сетевая ошибка: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
        Возврат Ложь;
    КонецПопытки;
КонецФункции