Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
        Ответственный = Пользователи.ТекущийПользователь();
    КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    Движения.ТоварыНаСкладах.Записывать = Истина;
    Движения.УчётЗатрат.Записывать      = Истина;
    Движения.Хозрасчетный.Записывать    = Истина;

    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    Запрос.Текст =
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |    Товары.Номенклатура КАК Номенклатура,
    |    СУММА(Товары.Количество) КАК Количество,
    |    СУММА(Товары.Сумма) КАК Сумма,
    |    МАКСИМУМ(Товары.Номенклатура.СчетБухгалтерскогоУчета) КАК СчетБухгалтерскогоУчета
    |ИЗ
    |    Документ.ПоступлениеТоваровИУслуг.Товары КАК Товары
    |ГДЕ
    |    Товары.Ссылка = &Ссылка
    |СГРУППИРОВАТЬ ПО
    |    Товары.Номенклатура
    |;
    |
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |    Услуги.СтатьяЗатрат КАК СтатьяЗатрат,
    |    Услуги.Услуга.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета,
    |    СУММА(Услуги.Сумма) КАК Сумма
    |ИЗ
    |    Документ.ПоступлениеТоваровИУслуг.Услуги КАК Услуги
    |ГДЕ
    |    Услуги.Ссылка = &Ссылка
    |СГРУППИРОВАТЬ ПО
    |    Услуги.СтатьяЗатрат,
    |    Услуги.Услуга.СчетБухгалтерскогоУчета";
	
	Результаты = Запрос.ВыполнитьПакет();
	
	СчетКредита = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
	
	ВыборкаТовары = Результаты[0].Выбрать();
    Пока ВыборкаТовары.Следующий() Цикл
        Движение              = Движения.ТоварыНаСкладах.Добавить();
        Движение.ВидДвижения  = ВидДвиженияНакопления.Приход;
        Движение.Период       = Дата;
        Движение.Организация  = Организация;
        Движение.Склад        = Склад;
        Движение.Номенклатура = ВыборкаТовары.Номенклатура;
        Движение.Количество   = ВыборкаТовары.Количество;
        Движение.Сумма        = ВыборкаТовары.Сумма;

        ДвижениеБух            = Движения.Хозрасчетный.Добавить();
        ДвижениеБух.Период     = Дата;
        ДвижениеБух.СчетДт     = ВыборкаТовары.СчетБухгалтерскогоУчета;
        ДвижениеБух.СчетКт     = СчетКредита;
        ДвижениеБух.Сумма      = ВыборкаТовары.Сумма;
        ДвижениеБух.Содержание = "Отражено поступление ТМЦ от поставщика";
        БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(ДвижениеБух.СчетДт, ДвижениеБух.СубконтоДт, ВыборкаТовары.Номенклатура);
        БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(ДвижениеБух.СчетКт, ДвижениеБух.СубконтоКт, Контрагент);
    КонецЦикла;

    ВыборкаУслуги = Результаты[1].Выбрать();
    Пока ВыборкаУслуги.Следующий() Цикл
        Движение              = Движения.УчётЗатрат.Добавить();
        Движение.Период       = Дата;
        Движение.Организация  = Организация;
        Движение.СтатьяЗатрат = ВыборкаУслуги.СтатьяЗатрат;
        Движение.Сумма        = ВыборкаУслуги.Сумма;

        ДвижениеБух            = Движения.Хозрасчетный.Добавить();
        ДвижениеБух.Период     = Дата;
        ДвижениеБух.СчетДт     = ВыборкаУслуги.СчетБухгалтерскогоУчета;
        ДвижениеБух.СчетКт     = СчетКредита;
        ДвижениеБух.Сумма      = ВыборкаУслуги.Сумма;
        ДвижениеБух.Содержание = "Отражено поступление услуг от поставщика";
        БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(ДвижениеБух.СчетДт, ДвижениеБух.СубконтоДт, ВыборкаУслуги.СтатьяЗатрат);
        БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(ДвижениеБух.СчетКт, ДвижениеБух.СубконтоКт, Контрагент);
    КонецЦикла;

КонецПроцедуры