Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
        Ответственный = Пользователи.ТекущийПользователь();
    КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Реализация") Тогда
		ВидОперации = Перечисления.ВидыОперацийРасходаДенег.ВозвратПокупателю;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
		ВидОперации = Перечисления.ВидыОперацийРасходаДенег.ОплатаПоставщику;
	Иначе
		Возврат;
	КонецЕсли;

	ДокументОснование = ДанныеЗаполнения;
	Получатель        = ДанныеЗаполнения.Контрагент;
	Договор           = ДанныеЗаполнения.Договор;
	СуммаДокумента    = ДанныеЗаполнения.СуммаДокумента;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    Движения.ДенежныеСредства.Записывать              = Истина;
    Движения.ДенежныеСредства.БлокироватьДляИзменения = Истина;
    Движения.Хозрасчетный.Записывать                  = Истина;

    Движение             = Движения.ДенежныеСредства.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
    Движение.Период      = Дата;
    Движение.Организация = Организация;
    Движение.Касса       = Касса;
    Движение.Сумма       = СуммаДокумента;

    Движения.Записать();

    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени()));
    Запрос.УстановитьПараметр("Организация",   Организация);
    Запрос.УстановитьПараметр("Касса",         Касса);
    Запрос.Текст =
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |    ПРЕДСТАВЛЕНИЕ(ДенежныеСредстваОстатки.Касса) КАК Касса,
    |    -ДенежныеСредстваОстатки.СуммаОстаток        КАК Сумма
    |ИЗ
    |    РегистрНакопления.ДенежныеСредства.Остатки(
    |        &МоментВремени,
    |        Организация = &Организация
    |        И Касса = &Касса) КАК ДенежныеСредстваОстатки
    |ГДЕ
    |    ДенежныеСредстваОстатки.СуммаОстаток < 0";

    РезультатЗапроса = Запрос.Выполнить();
    Если НЕ РезультатЗапроса.Пустой() Тогда
        Отказ = Истина;
        Выборка = РезультатЗапроса.Выбрать();
        Выборка.Следующий();
        ОбщегоНазначения.СообщитьПользователю(
            СтрШаблон("По кассе ""%1"" недостаточно средств для расхода в размере %2",
                Выборка.Касса, Выборка.Сумма));
    КонецЕсли;

    АналитикаПроводки = ПолучитьАналитикуПроводки();
    ДвижениеБух            = Движения.Хозрасчетный.Добавить();
    ДвижениеБух.Период     = Дата;
    ДвижениеБух.СчетДт     = АналитикаПроводки.СчетДебета;
    ДвижениеБух.СчетКт     = АналитикаПроводки.СчетКредита;
    ДвижениеБух.Сумма      = СуммаДокумента;
    ДвижениеБух.Содержание = АналитикаПроводки.СодержаниеОперации;
    БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(
        ДвижениеБух.СчетДт, ДвижениеБух.СубконтоДт, АналитикаПроводки.СубконтоДебет);
    БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(
        ДвижениеБух.СчетКт, ДвижениеБух.СубконтоКт, АналитикаПроводки.СубконтоКредит);

КонецПроцедуры


Функция ПолучитьАналитикуПроводки()
    АналитикаПроводки = Новый Структура;
    АналитикаПроводки.Вставить("СчетКредита",    ПланыСчетов.Хозрасчетный.Касса);
    АналитикаПроводки.Вставить("СубконтоКредит", Касса);
    Если ВидОперации = Перечисления.ВидыОперацийРасходаДенег.ОплатаПоставщику Тогда
        АналитикаПроводки.Вставить("СчетДебета",        ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками);
        АналитикаПроводки.Вставить("СубконтоДебет",     Получатель);
        АналитикаПроводки.Вставить("СодержаниеОперации", "Оплата поставщику наличными из кассы");
    ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходаДенег.ВозвратПокупателю Тогда
        АналитикаПроводки.Вставить("СчетДебета",        ПланыСчетов.Хозрасчетный.РасчетыСПокупателями);
        АналитикаПроводки.Вставить("СубконтоДебет",     Получатель);
        АналитикаПроводки.Вставить("СодержаниеОперации", "Возврат покупателю наличными из кассы");
    ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходаДенег.ВыдачаЗаработнойПлаты Тогда
        АналитикаПроводки.Вставить("СчетДебета",        ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда);
        АналитикаПроводки.Вставить("СубконтоДебет",     Получатель);
        АналитикаПроводки.Вставить("СодержаниеОперации", "Выплата заработной платы наличными из кассы");
    ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходаДенег.ВыдачаПодотчетнику Тогда
        АналитикаПроводки.Вставить("СчетДебета",        ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами);
        АналитикаПроводки.Вставить("СубконтоДебет",     Получатель);
        АналитикаПроводки.Вставить("СодержаниеОперации", "Выдача денежных средств подотчётному лицу");
    КонецЕсли;
    Возврат АналитикаПроводки;
КонецФункции