Функция createOrderPOST(Запрос)
    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку());
    ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON, Ложь);
    ЧтениеJSON.Закрыть();

    НоваяЗапись = Документы.ПредварительнаяЗапись.СоздатьДокумент();
    НоваяЗапись.Дата = ТекущаяДата();
	НоваяЗапись.ДатаЗаписи = ПрочитатьДатуJSON(ДанныеЗапроса.ДатаЗаписи, ФорматДатыJSON.ISO);
	НоваяЗапись.Сотрудник  = Справочники.Сотрудники.НайтиПоНаименованию(ДанныеЗапроса.Сотрудник);
	НоваяЗапись.Клиент     = НайтиКонтрагентаПоЛогину(ДанныеЗапроса.Логин);
	
	Для Каждого СтруктураУслуги Из ДанныеЗапроса.МассивУслуг Цикл
		НоменклатураУслуги     = Справочники.Номенклатура.НайтиПоНаименованию(СтруктураУслуги.Услуга);
		ЦенаУслуги             = ПолучитьЦенуУслуги(НоменклатураУслуги, НоваяЗапись.ДатаЗаписи);
		
		НоваяУслуга            = НоваяЗапись.Услуги.Добавить();
		НоваяУслуга.Услуга     = НоменклатураУслуги;
		НоваяУслуга.Количество = 1;
		НоваяУслуга.Цена       = ЦенаУслуги;
		НоваяУслуга.Сумма      = ЦенаУслуги;
	КонецЦикла;
	
	НоваяЗапись.СуммаДокумента = НоваяЗапись.Услуги.Итог("Сумма");
	
	Попытка
		НоваяЗапись.Записать(РежимЗаписиДокумента.Проведение);
		Ответ = Новый HTTPСервисОтвет(200);
		ТекстОтвета = "Создан и проведён документ " + НоваяЗапись.Номер;
    Исключение
        Ответ = Новый HTTPСервисОтвет(500);
        ТекстОтвета = "Ошибка: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
    КонецПопытки;

    Ответ.УстановитьТелоИзСтроки(ТекстОтвета);
    Возврат Ответ;
КонецФункции

Функция ПолучитьЦенуУслуги(Номенклатура, Дата)
    Отбор = Новый Структура("Номенклатура, ВидЦены", Номенклатура, Перечисления.ВидыЦенПродажи.Розничная);
    ДанныеЦены = РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(Дата, Отбор);
    Возврат ДанныеЦены.Цена;
КонецФункции

Функция НайтиКонтрагентаПоЛогину(Логин)
    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("Логин", Логин);
    Запрос.Текст =
        "ВЫБРАТЬ ПЕРВЫЕ 1 Контрагенты.Ссылка КАК Ссылка
        |ИЗ Справочник.Контрагенты КАК Контрагенты
        |ГДЕ Контрагенты.ПользовательМП = &Логин
        |    И НЕ Контрагенты.ПометкаУдаления";
    Результат = Запрос.Выполнить();
    Если НЕ Результат.Пустой() Тогда
        Возврат Результат.Выгрузить()[0].Ссылка;
    КонецЕсли;
    Возврат Справочники.Контрагенты.ПустаяСсылка();
КонецФункции